# -*- coding: utf-8 -*-
"""
Created on Tue Mar  3 21:51:52 2020

@author: e010
"""
#==============================================================================
#Python 資料型別
'''布林值'''
print(bool(1))
print(bool(0))
print(bool(()))
'''整數'''
print(int(100))
print(int(3.14))
#字串轉整數
print(int('100',2))
'''浮點數'''
print(float(1))
print(float(3.14))
#字串轉浮點數
print(float('3.1415'))
'''字串'''
s= str('Python')
s1= 'Python 1'
s2= "Python 2"
#==============================================================================
#變數
#未定義
print(x)
#定義x
x=1
print(x)
#x大小寫有區別
print(X)
#變數運算
y=x+2
print(y)
#運算子==============================================================================
'''指定運算子'''
z=1+2
'''算術運算子'''

"""請練習+-*/ // % ** """

'''比較運算子'''
A=5<2
B=5<=5
C=5>2
D=5>=2
E=5!=2
F=5==2
'''邏輯運算子'''
x1=True
x2=False
y1=True
y2=False
andx1y1=x1 and y1
andx1y2=x1 and y2
andx2y1=x2 and y1
andx2y2=x2 and y2
#練習or與not

'''in 與is 運算子'''

x = [1,2,3]
x1= 1
y = [1,2,3]
print(x1 in y)
print(x in y)

print(x is y)
print(x1 is y)
#練習not in, is not

'''位元運算子 & | ^ ~ << >>'''
#從二進位角度來比一個位置做邏輯運算
A1=5&4
A2=5|4
A3=5^4
A4=~5
#將二進位往左移兩個位元移動後補零
A5=5<<2
#將二進位往右移兩個位元移動後補零
A6=5>>2
'''運算子優先權次序'''

#==============================================================================
#字串
'''字串運算子'''
#==============================================================================
